깃은 해당 디렉터리 하위의 내용까지 모두 추적해서 관리한다. 하지만 깃이 추적하지 않아도 되는 파일이 존재한다. 이를 .gitignore 설정파일 안에 나열하여 적어야 한다.  깃은 이 .gitignore 안에 있는 파일은 추적하지 않으며, 서버로 전송하거나 공유할 때에도 분리하여 처리한다. 

***주의 ! - .gitignore 파일은 저장소 폴더의 최상위 디렉토리에 두도록 하자.***

### .gitignore 파일의 표기법

- #으로 시작하는 줄은 주석으로 처리된다.
- 완전한 파일 이름을 적으면 해당 파일을 깃의 추적대상에서 제외시킨다. (경로가 있다면 경로도 같이 입력)
- 애스터리스크(*)를 사용하여 패턴을 정의할 수도 있다. *는 모든 문자열을 대체할 수 있기에 패턴을 확장시킬 수 있다. 이러한 문자를 셀 글로빙이라고 하기도 한다.
- 제외하지 않는 파일(깃이 추적해야 하는 파일)은 파일 이름 앞에 !(느낌표, not)를 사용한다.
- 디렉터리를 표현할 때에는 /(슬래시) 기호를 사용한다.
- 그 외의 정규 표현식을 응용하여 넣을 수도 있다.

```
# gitignore 파일 표기 예시

# dbinfo.php 파일은 깃 추적에서 제외함
dbinfo.php

# 오브젝트 파일은 제외함
*.obj

# 환경설정 파일은 제외하지 않는다.(추적한다)
!config.php

# 현재 디렉터리 내의 파일은 무시한다.
/readme.txt

# /pub/ 디렉터리 안의 모든 것을 무시한다.
/pub/

# doc 디렉터리 아래의 모든 .txt 파일은 무시한다.
doc/**/*.txt
```
